#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    double number = 56.7;
    cout << ceil(number) << endl; //ceil закръгля към най-близкото цяло число нагоре, по  голямо от даденото
    cout << floor(number) << endl;; // най-близкото цяло число, по - малко от даденото
    cout << abs(-6) << endl;
    //abs е абсолютна стойност; абсолютната стойност е числото без неговия знак, тоест винаги ще е цяло число, 
    //примерно -6 = 6, 6 = 6;
    cout << pow(2, 19) << endl;
    //pow е power 2 на 19та степен, тоест това е функционалност за повдигане на число на степен;
    cout << sqrt(81) << endl; //това е корен квадратен;

// Функционалности на библиотеката math
}

